; domain
(define
	(domain mundobloques)
	(:requirements :strips :typing)
	(:types
		bloque - object
	)
	(:predicates
		(agarrado ?b - bloque)
		(brazo-libre )
		(despejado ?b - bloque)
		(sobre ?b1 - bloque ?b2 - bloque)
		(sobre-la-mesa ?b - bloque)
	)
	(:action agarrar
		:parameters (?b - bloque)
		:precondition (and (sobre-la-mesa ?b) (despejado ?b) (brazo-libre ))
		:effect (and (agarrado ?b) (not (sobre-la-mesa ?b)) (not (despejado ?b)) (not (brazo-libre )))
	)
	(:action apilar
		:parameters (?b1 - bloque ?b2 - bloque)
		:precondition (and (agarrado ?b1) (despejado ?b2))
		:effect (and (sobre ?b1 ?b2) (despejado ?b1) (brazo-libre ) (not (agarrado ?b1)) (not (despejado ?b2)))
	)
	(:action bajar
		:parameters (?b - bloque)
		:precondition (agarrado ?b)
		:effect (and (sobre-la-mesa ?b) (despejado ?b) (brazo-libre ) (not (agarrado ?b)))
	)
	(:action desapilar
		:parameters (?b1 - bloque ?b2 - bloque)
		:precondition (and (sobre ?b1 ?b2) (despejado ?b1) (brazo-libre ))
		:effect (and (agarrado ?b1) (despejado ?b2) (not (sobre ?b1 ?b2)) (not (despejado ?b1)) (not (brazo-libre )))
	)
)

; problem
(define
	(problem mundobloques)
	(:domain mundobloques)
	(:objects
		A B C - bloque
	)
	(:init (sobre A C) (despejado A) (sobre-la-mesa B) (despejado B) (sobre-la-mesa C) (brazo-libre))
	(:goal (and (sobre-la-mesa A) (sobre B A) (sobre C B)))
)

; plan
1. (desapilar a c)
   deleted: (sobre a c) (despejado a) (brazo-libre)
   added: (agarrado a) (despejado c)
   goals met: 0 of 3
2. (bajar a)
   deleted: (agarrado a)
   added: (sobre-la-mesa a) (despejado a) (brazo-libre)
   goals met: 1 of 3
3. (agarrar b)
   deleted: (sobre-la-mesa b) (despejado b) (brazo-libre)
   added: (agarrado b)
   goals met: 1 of 3
4. (apilar b a)
   deleted: (agarrado b) (despejado a)
   added: (sobre b a) (despejado b) (brazo-libre)
   goals met: 2 of 3
5. (agarrar c)
   deleted: (sobre-la-mesa c) (despejado c) (brazo-libre)
   added: (agarrado c)
   goals met: 2 of 3
6. (apilar c b)
   deleted: (agarrado c) (despejado b)
   added: (sobre c b) (despejado c) (brazo-libre)
   goals met: 3 of 3
